# GetDXFExportOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportDWGSettings..::..GetDXFExportOptions Method
ExportDWGSettings Class See Also
---
Gets the options stored in the these settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public DXFExportOptions GetDXFExportOptions()
```

Visual Basic
---
```text
Public Function GetDXFExportOptions As DXFExportOptions
```

Visual C++
---
```text
public:
DXFExportOptions^ GetDXFExportOptions()
```

# ### Return Value
The options
# See Also
ExportDWGSettings Class
Autodesk.Revit.DB Namespace